{"generatedBy": "keras v2.4.0", "weightsManifest": [{"weights": [{"name": "dense/kernel", "dtype": "float32", "shape": [1000, 1000]}, {"name": "dense/bias", "dtype": "float32", "shape": [1000]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [1000, 13532]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [13532]}, {"name": "embedding/embeddings", "dtype": "float32", "shape": [13532, 10]}, {"name": "lstm/lstm_cell/kernel", "dtype": "float32", "shape": [10, 4000]}, {"name": "lstm/lstm_cell/recurrent_kernel", "dtype": "float32", "shape": [1000, 4000]}, {"name": "lstm/lstm_cell/bias", "dtype": "float32", "shape": [4000]}, {"name": "lstm_1/lstm_cell_1/kernel", "dtype": "float32", "shape": [1000, 4000]}, {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "dtype": "float32", "shape": [1000, 4000]}, {"name": "lstm_1/lstm_cell_1/bias", "dtype": "float32", "shape": [4000]}], "paths": ["group1-shard1of26.bin", "group1-shard2of26.bin", "group1-shard3of26.bin", "group1-shard4of26.bin", "group1-shard5of26.bin", "group1-shard6of26.bin", "group1-shard7of26.bin", "group1-shard8of26.bin", "group1-shard9of26.bin", "group1-shard10of26.bin", "group1-shard11of26.bin", "group1-shard12of26.bin", "group1-shard13of26.bin", "group1-shard14of26.bin", "group1-shard15of26.bin", "group1-shard16of26.bin", "group1-shard17of26.bin", "group1-shard18of26.bin", "group1-shard19of26.bin", "group1-shard20of26.bin", "group1-shard21of26.bin", "group1-shard22of26.bin", "group1-shard23of26.bin", "group1-shard24of26.bin", "group1-shard25of26.bin", "group1-shard26of26.bin"]}], "modelTopology": {"model_config": {"config": {"name": "sequential", "layers": [{"config": {"name": "embedding_input", "dtype": "float32", "batch_input_shape": [null, 1], "sparse": false, "ragged": false}, "class_name": "InputLayer"}, {"config": {"dtype": "float32", "embeddings_constraint": null, "mask_zero": false, "batch_input_shape": [null, 1], "embeddings_regularizer": null, "output_dim": 10, "trainable": true, "input_length": 1, "input_dim": 13532, "name": "embedding", "activity_regularizer": null, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}}, "class_name": "Embedding"}, {"config": {"stateful": false, "recurrent_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "go_backwards": false, "trainable": true, "units": 1000, "kernel_regularizer": null, "name": "lstm", "dropout": 0.0, "unit_forget_bias": true, "recurrent_activation": "sigmoid", "implementation": 2, "return_sequences": true, "use_bias": true, "recurrent_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "bias_constraint": null, "return_state": false, "time_major": false, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"stateful": false, "recurrent_regularizer": null, "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "go_backwards": false, "trainable": true, "units": 1000, "kernel_regularizer": null, "name": "lstm_1", "dropout": 0.0, "unit_forget_bias": true, "recurrent_activation": "sigmoid", "implementation": 2, "return_sequences": false, "use_bias": true, "recurrent_constraint": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "activation": "tanh", "activity_regularizer": null, "bias_constraint": null, "return_state": false, "time_major": false, "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "units": 1000, "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "name": "dense", "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "bias_constraint": null, "units": 13532, "activity_regularizer": null, "kernel_regularizer": null, "dtype": "float32", "name": "dense_1", "use_bias": true}, "class_name": "Dense"}]}, "class_name": "Sequential"}, "training_config": {"metrics": null, "loss": "categorical_crossentropy", "loss_weights": null, "weighted_metrics": null, "optimizer_config": {"config": {"learning_rate": 0.0010000000474974513, "epsilon": 1e-07, "beta_1": 0.8999999761581421, "decay": 0.0, "amsgrad": false, "beta_2": 0.9990000128746033, "name": "Adam"}, "class_name": "Adam"}}, "keras_version": "2.4.0", "backend": "tensorflow"}, "convertedBy": "TensorFlow.js Converter v3.7.0", "format": "layers-model"}